In [5]:
import pandas as pd
df1 = pd.DataFrame({
    'name': ['Jessica', 'Liam', 'Sophia', 'Ryan', 'Alex'],
    'gender': ['F', 'M', 'F', 'M', 'F'],
    'age': [21, 23, 20, 22, 20]
})
df2 = pd.DataFrame({
    'name': ['Sophia', 'Liam', 'Ryan', 'Alex', 'Jessica'],
    'department': ['computer science', 'mathematics', 'law',
                   'computer science', 'law']
})

df4 = pd.DataFrame({
    'department': ['computer science', 'mathematics', 'law'],
    'head of department': ['Steve', 'Emma', 'Carly']
})
df1

      name gender  age
0  Jessica      F   21
1     Liam      M   23
2   Sophia      F   20
3     Ryan      M   22
4     Alex      F   20

In [ ]:
df2

      name        department
0   Sophia  computer science
1     Liam       mathematics
2     Ryan               law
3     Alex  computer science
4  Jessica               law

In [ ]:
df3 = pd.merge(df1, df2) # = pd.merge(df1, df2, on='name')
df3

      name gender  age        department
0  Jessica      F   21               law
1     Liam      M   23       mathematics
2   Sophia      F   20  computer science
3     Ryan      M   22               law
4     Alex      F   20  computer science

In [7]:
df5 = pd.merge(df3, df4)
df5

      name gender  age        department head of department
0  Jessica      F   21               law              Carly
1     Liam      M   23       mathematics               Emma
2   Sophia      F   20  computer science              Steve
3     Ryan      M   22               law              Carly
4     Alex      F   20  computer science              Steve

In [8]:
df5 = pd.merge(df3, df4, on ='department')
df5

      name gender  age        department head of department
0  Jessica      F   21               law              Carly
1     Liam      M   23       mathematics               Emma
2   Sophia      F   20  computer science              Steve
3     Ryan      M   22               law              Carly
4     Alex      F   20  computer science              Steve

In [10]:
df5.sort_values('age', ascending=False)

      name gender  age        department head of department
1     Liam      M   23       mathematics               Emma
3     Ryan      M   22               law              Carly
0  Jessica      F   21               law              Carly
2   Sophia      F   20  computer science              Steve
4     Alex      F   20  computer science              Steve

In [12]:
df5.value_counts()

name     gender  age  department        head of department
Alex     F       20   computer science  Steve                 1
Jessica  F       21   law               Carly                 1
Liam     M       23   mathematics       Emma                  1
Ryan     M       22   law               Carly                 1
Sophia   F       20   computer science  Steve                 1
Name: count, dtype: int64

In [14]:
df5['gender'].value_counts()

gender
F    3
M    2
Name: count, dtype: int64

In [17]:
df5['head of department'].value_counts()

head of department
Carly    2
Steve    2
Emma     1
Name: count, dtype: int64

In [18]:
df5.describe()

            age
count   5.00000
mean   21.20000
std     1.30384
min    20.00000
25%    20.00000
50%    21.00000
75%    22.00000
max    23.00000

In [21]:
df10 = pd.DataFrame({
    'test': [45, 30, 40, 37, 48],
    'assign1': [20, 17, 22, 18, 24],
    'assign2': [19, 14, 18, 15, 25]
})
print(df10)
df10.describe()

   test  assign1  assign2
0    45       20       19
1    30       17       14
2    40       22       18
3    37       18       15
4    48       24       25

            test    assign1   assign2
count   5.000000   5.000000   5.00000
mean   40.000000  20.200000  18.20000
std     7.035624   2.863564   4.32435
min    30.000000  17.000000  14.00000
25%    37.000000  18.000000  15.00000
50%    40.000000  20.000000  18.00000
75%    45.000000  22.000000  19.00000
max    48.000000  24.000000  25.00000

In [23]:
df10.dtypes

test       int64
assign1    int64
assign2    int64
dtype: object